nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_ProtocolHandle.c
/**
  ******************************************************************************
  * <h2><center>&copy; Intelenics Co., Ltd.</center></h2>
  * @file    	INT_STM32F4_ProtocolHandle.c
  * @author  	BIG M
  * @version 	V1.0.0
  * @date    	16-June-2014
  * @brief   
  ******************************************************************************
  * @attention
  *
  ******************************************************************************
  */

#include "stm32f4xx.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>

#include "Sensors_Task.h"
#include "SD_Task.h"
#include "stm32f4_SDCard.h"
#include "SL_ConfigStruct.h"
#include "SL_PinDefine.h"
#include "INT_STM32F4_ProtocolHandle.h"
#include "INT_STM32F4_ProtocolComm.h"
#include "INT_STM32F4_ProtocolParser.h"
#include "INT_STM32F4_420RClick.h"
#include "INT_STM32F4_rtc.h"
#include "INT_STM32F4_debug.h"
#include "INT_STM32F4_ConfigSD.h"
#include "INT_STM32F4_24LC512.h"
#include "tm_stm32f4_ds1307.h"

extern STCONFIG_DEV 		struct_DevConfig;
extern __IO uint32_t 		_ADC_TClick;
extern __IO uint32_t		_Transmit_Period;
extern __IO bool				flag_isSDInstall;
extern __IO uint8_t 		_index_pulseData;
extern __IO uint8_t			_PulseData_Counter;
extern __IO uint8_t			_ConfigCmdACK;
extern __IO uint8_t			_LED_ERR_ON;

/* Flag Is Configuration Update from Debug_Port */
bool 	flag_isConfPropUpdate 									= false;
bool 	flag_isConfOperUpdate 									= false;
bool 	flag_isConfBuzzUpdate 									= false;
bool 	flag_isConfWorkUpdate 									= false;
bool 	flag_isConfNetwUpdate 									= false;
bool 	flag_isConf420SensUpdate[MAX_420SENSOR] = {false,false,false,false,false,false};
bool 	flag_isConfADCSensUpdate[MAX_ADCSENSOR] = {false,false};
bool 	flag_isConfMODBUSSensUpdate 						= false;
bool 	flag_isConfPulsSensUpdate 							= false;
bool 	flag_isConf420AlamUpdate[MAX_420SENSOR] = {false,false,false,false,false,false};
bool 	flag_isConfADCAlamUpdate[MAX_ADCSENSOR] = {false,false};
bool 	flag_isConfMODBUSAlamUpdate							= false;
bool 	flag_isConfPulsAlamUpdate 							= false;
bool 	flag_isConfDINUpdate[MAX_DIGItIN] 			= {false,false,false,false,false,false,false,false,false,false,false,false};
bool 	flag_isConfValveUpdate 									= false;

uint32_t DOUTn_BASEADDR[MAX_DOUT] = {DOUT1_BASEADDR, DOUT2_BASEADDR ,DOUT3_BASEADDR, DOUT4_BASEADDR};

extern void vMAIN_PrintConfig(uint8_t printLevel, uint8_t config_id, void *st_config, uint8_t ch);
extern uint8_t ucMAIN_SetDefaultInformation(void);
extern uint8_t ucMAIN_SetDefaultStatus(void);
extern uint8_t ucMAIN_SetDefaultConfig(void);

extern SENSOR_DATA 					_Sensor_Data;


/*==========================================================================================*/
/**
  * @brief  
  * @param  
  * @retval Handle Status
  */	
uint8_t vPTCHANDLE_LogManipulate(uint8_t *date, uint8_t fid) {
	
	char 						day[] = {"00"};
	char 						month[] = {"00"};
	char 						year[] = {"0000"};
	
	RTC_DateTypeDef RTC_DateStruct;
	RTC_TimeTypeDef RTC_TimeStruct;
	ST_LOG_DATA 		data;
	
	memcpy(&day[0], &date[0], 2);
	memcpy(&month[0], &date[2], 2);
	memcpy(&year[0], &date[4], 4);
	RTC_DateStruct.RTC_Date 		= atoi(day);
	RTC_DateStruct.RTC_Month 		= atoi(month);
	RTC_DateStruct.RTC_Year 		= (atoi(year)-2000);
	RTC_TimeStruct.RTC_Hours 		= 0;
	RTC_TimeStruct.RTC_Minutes 	= 0;
	RTC_TimeStruct.RTC_Seconds 	= 0;
	
	data.cmd 				= LOG_CMD_READ;
	data.fid				= fid;
	data.timestamp 	= uiRTC_DateTimeToEpoch(RTC_DateStruct, RTC_TimeStruct);
	
	printDebug_Semphr(INFO, "<PTCHANDLE_LogManipulate>: Date required %d/%d/%d (%d)\r\n", RTC_DateStruct.RTC_Date,
																																												RTC_DateStruct.RTC_Month,
																																												RTC_DateStruct.RTC_Year+2000,
																																												data.timestamp);
	
	if(!xQueueSend(Queue_DataToSD, &data, 0)) {
		printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_LogManipulate>: Send Queue_DataToSD failed. \r\n");
	}
	
	return 0;
}
/*==========================================================================================*/
/**
  * @brief  This function handle Read Properties_Configuration packet.
  * @param  Configuration Specific Structure
  * @retval Handle Status
  */	
uint8_t vPTCHANDLE_ConfigRead(uint8_t cnfg, uint8_t *confSpec, uint16_t *specLen) {
	
	uint8_t 	sen420Ch      = 0;
	uint8_t 	dinCh					= 0;
	uint8_t		sensAlarmCh		= 0;
	
	if(cnfg == CONF_CNFG_PROPERTIES) {																			/*--- Properties Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigProperties, sizeof(STCONFIG_PROPERTIES));
		*specLen = sizeof(STCONFIG_PROPERTIES);
	}else if(cnfg == CONF_CNFG_DEV) {																				/*--- Deverloper Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_DevConfig, sizeof(STCONFIG_DEV));
		*specLen = sizeof(STCONFIG_DEV);
	}else if(cnfg == CONF_CNFG_OPERATING) {																	/*--- Operating Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigOperating,  sizeof(STCONFIG_OPERATING));
		*specLen = sizeof(STCONFIG_OPERATING);
		printDebug_Semphr(INFO, "<ucPTCHANDLE_ConfigRead> %d \r\n", *specLen);
	}else if(cnfg == CONF_CNFG_BUZZER) {																		/*--- Buzzer Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigBuzzer,  sizeof(STCONFIG_BUZZER));
		*specLen = sizeof(STCONFIG_BUZZER);
	}else if(cnfg == CONF_CNFG_WORKING) {																		/*--- Working Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigWorking,  sizeof(STCONFIG_WORKING));
		*specLen = sizeof(STCONFIG_WORKING);
	}else if(cnfg == CONF_CNFG_NETWORK) {																		/*--- Network Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigNetwork, sizeof(STCONFIG_NETWORK));
		*specLen = sizeof(STCONFIG_NETWORK);
	}else if((cnfg&0xF0) == CONF_CNFG_420SENSOR1) {													/*--- Analog Sensor ---*/																																		/*-------- 4-20mA Sensor Config CH1-6 (0xA0-0xA5) */
		/* Index 4-20mA Sensor Configuration */
		sen420Ch = (cnfg&0x0F);
		if(sen420Ch <= 5) {																										/*--- 4-20mA Sensor Config CH1-6 (0xA0-0xA5) ---*/	
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_Config420Sensor[sen420Ch], sizeof(STCONFIG_ANALOGSENSOR));
			*specLen = sizeof(STCONFIG_ANALOGSENSOR);
		}else if((sen420Ch >= 0x06) && (sen420Ch <= 0x07)) {									/*--- ADCSensor Config CH1-2 (0xA6-0xA7) ---*/
			/* Update index */
			sen420Ch -= 0x06;
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_ConfigADCSensor[sen420Ch], sizeof(STCONFIG_ANALOGSENSOR));
			*specLen = sizeof(STCONFIG_ANALOGSENSOR);
		}else if((sen420Ch >= 0x08) && (sen420Ch <= 0x0D)) {									/*--- 4-20mA Sensor Calibration CH1-6 (0xA8-0xAD) ---*/
			/* Update index */
			sen420Ch -= 0x08;
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_Config420Cal[sen420Ch], sizeof(STCONFIG_420CAL));
			*specLen = sizeof(STCONFIG_420CAL);
		}else if(sen420Ch == 0x0E) {																					/*--- 4-20mAInput Valve Calibration (0xAE) ---*/
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_Config420ValveInCal, sizeof(STCONFIG_420CAL));
			*specLen = sizeof(STCONFIG_420CAL);
		}else if(sen420Ch == 0x0F) {																					/*--- 4-20mAOutput Valve Calibration (0xAF) ---*/
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_Config420ValveOutCal, sizeof(STCONFIG_420CAL));
			*specLen = sizeof(STCONFIG_420CAL);
		}
	}else if(cnfg == CONF_CNFG_MODBUSSENS) {																/*--- MODBUS FlowSensor Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigMODBUSSensor, sizeof(STCONFIG_MODBUSSENSOR));
		*specLen = sizeof(STCONFIG_MODBUSSENSOR);
	}else if(cnfg == CONF_CNFG_PULSESENS) {																	/*--- Pulse Sensor Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigPulseSensor, sizeof(STCONFIG_PULSESENSOR));
		*specLen = sizeof(STCONFIG_PULSESENSOR);
	}else if(cnfg == CONF_CNFG_PULSEADJ) {
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigPulseADJ, sizeof(STCONFIG_PULSEADJ));
		*specLen = sizeof(STCONFIG_PULSEADJ);
	}else if((cnfg&0xF0) == CONF_CNFG_DIN1) {																/*--- Digital Input CH1-12 ---*/
		/* Index Digital Input Channel id */
		dinCh = (cnfg&0x0F);
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigDIN[dinCh], sizeof(STCONFIG_DIGITALsIN));
		*specLen = sizeof(STCONFIG_DIGITALsIN);
	}else if((cnfg&0xF0) == CONF_CNFG_420SENsAL1) {													/*--- Analog Sensor ---*/
		/* Arr Index */
		sensAlarmCh = (cnfg&0x0F);
		if(sensAlarmCh <= 0x05) {																							/*-------- 4-20mA Sensor Alarm CH1-6 (0xD0-0xD5) */	
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_Config420SensorAlarm[sensAlarmCh], sizeof(STCONFIG_SENSORALARM));
			*specLen = sizeof(STCONFIG_SENSORALARM);
		}else if((sensAlarmCh >= 0x06) && (sensAlarmCh <= 0x07)) {						/*-------- ADCSensor Config Alarm CH1 (0xD6) */
			sensAlarmCh -= 0x06;
			/* Copy Config_Structure into Config_Specific(Data Packet) */
			memcpy(confSpec, &struct_ConfigADCSensorAlarm[sensAlarmCh], sizeof(STCONFIG_SENSORALARM));
			*specLen = sizeof(STCONFIG_SENSORALARM);
		}
	}else if(cnfg == CONF_CNFG_MODBUSSENsAL) { 															/*--- MODBUS FlowSensor Alarm ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigMODBUSSensorAlarm, sizeof(STCONFIG_SENSORALARM));
		*specLen = sizeof(STCONFIG_SENSORALARM);
	}else if(cnfg == CONF_CNFG_PULSENsAL) {																	/*--- Pulse Sensor Alarm ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigPulseSensorAlarm, sizeof(STCONFIG_SENSORALARM));
		*specLen = sizeof(STCONFIG_SENSORALARM);
	}else if(cnfg == CONF_CNFG_VALVE) {																			/*--- Valve Config ---*/
		/* Copy Config_Structure into Config_Specific(Data Packet) */
		memcpy(confSpec, &struct_ConfigValve, sizeof(STCONFIG_VALVE));
		*specLen = sizeof(STCONFIG_VALVE);
	}else {
		printDebug_Semphr(MINOR_ERR, "<ucPTCHANDLE_ConfigRead> CNFG not define yet. \r\n");
		return 2;
	}
	
