nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_ProtocolHandle.c
	return 0;
}
/*==========================================================================================*/
/**
  * @brief  This function handle Write Configuration packet.
  * @param  Configuration Specific Structure
  * @retval Handle Status
  */	
uint8_t ucPTCHANDLE_ConfigWrite(uint8_t *confSpec, uint8_t src) {
	
	uint8_t   printLevel 		= INFO;
	uint8_t 	analogIndex  	= 0;
	uint8_t 	dinCh					= 0;
	uint8_t		sensAlarmCh		= 0;
	uint8_t 	validate_res	= 0;
	uint8_t		copy_cmd			= 0;
	float 		tmp_calValue	= 0.0;
	float			tmp_float			= 0.0;
	bool			isFileOpen		= false;
	
	STCONFIG_DEV 					tmp_DevConfig;
	STCONFIG_PROPERTIES		tmp_ConfigProperties;
	STCONFIG_OPERATING		tmp_ConfigOperating;
	STCONFIG_BUZZER				tmp_ConfigBuzzer;
	STCONFIG_WORKING			tmp_ConfigWorking;
	STCONFIG_NETWORK 			tmp_ConfigNetwork; 
	STCONFIG_ANALOGSENSOR tmp_ConfigAnalogSensor;
	STCONFIG_MODBUSSENSOR	tmp_ConfigMODBUSSensor;
	STCONFIG_PULSESENSOR	tmp_ConfigPulseSensor;
	STCONFIG_PULSEADJ			tmp_ConfigPulseADJ;
	STCONFIG_DIGITALsIN 	tmp_ConfigDIN;
	STCONFIG_SENSORALARM 	tmp_ConfigSensorAlarm;
	STCONFIG_VALVE				tmp_ConfigValve;
	STCONFIG_420CAL				tmp_Config420Cal;
	ST_CONFIG_Q						stBuf_conf;
		
	if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_DEV) {																												/*--- Dev Config ---*/
		memcpy(&tmp_DevConfig, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_DEV));															/* Copy to temp config structure */
		vMAIN_PrintConfig(printLevel, DEV_CONF, &tmp_DevConfig, CH_NONE);																			/* Print Config */
		validate_res = PTCPARSER_ValidateConfigDev(&tmp_DevConfig);																						/* Validate config */
		if(validate_res) {
			printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Validate failed(ERR_%d) \r\n", validate_res);
			return 1;
		}else {
			if(EEPROM_WriteBuf(DEVeCONF_BASEADDR, &tmp_DevConfig, sizeof(STCONFIG_DEV))) {										/* Save Configuration into EEPROM */
				printDebug(MAJOR_ERR, "<PTCHANDLE_ConfigWrite>: EEPROM_Write Deverloper_Configuration Error \r\n");
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_DevConfig, &tmp_DevConfig, sizeof(STCONFIG_DEV));																	/* Save Configuration into Config_Structure */
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_PROPERTIES) {																						/*--- Properties Config ---*/
		memcpy(&tmp_ConfigProperties, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_PROPERTIES));
		vMAIN_PrintConfig(printLevel, PROPERTIES_CONF, &tmp_ConfigProperties, CH_NONE);
		if(EEPROM_WriteBuf(PROPERTIES_BASEADDR, &tmp_ConfigProperties, sizeof(STCONFIG_PROPERTIES))) {			/* Save Configuration into EEPROM */
			printDebug(MAJOR_ERR, "<PTCHANDLE_ConfigWrite>: EEPROM_Write Properties_Configuration Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigProperties, &tmp_ConfigProperties, sizeof(STCONFIG_PROPERTIES));								/* Save Configuration into Config_Structure */
			if(src == DEBUG_PORT) {																																							/* If config from debug port, Set flag for update to server */
				flag_isConfPropUpdate = true;
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_CMD) {																									/*--- Config Management ---*/
		switch(confSpec[CONF_INDEX_SPEC]) {
			case SET_DEFAULT_INFO:
				if(ucMAIN_SetDefaultInformation()) {
					_ConfigCmdACK = CONF_ACK_ERR;
				}else {
					_ConfigCmdACK = CONF_ACK_OK;
				}
				break;
			case LOAD_INFO:
				copy_cmd = LOAD_INFO;
				if(!xQueueSend(Queue_CopyFromSD, &copy_cmd, 0)) {
					printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Send Queue_CopyFromSD failed. \r\n");
				}
				break;
			case SET_DEFAULT_CONF:
				if(ucMAIN_SetDefaultConfig()) {
					_ConfigCmdACK = CONF_ACK_ERR;
				}else {
					_ConfigCmdACK = CONF_ACK_OK;
				}
				break;
			case LOAD_CONF:
				copy_cmd = LOAD_CONF;
				if(!xQueueSend(Queue_CopyFromSD, &copy_cmd, 0)) {
					printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Send Queue_CopyFromSD failed. \r\n");
				}
				break;
			default:
				break;
		}
		return CONF_CNFG_CMD;
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_OPERATING) {																						/*--- Operating Config ---*/
		memcpy(&tmp_ConfigOperating, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_OPERATING));									/* Copy to temp config structure */
		vMAIN_PrintConfig(printLevel, OPERATING_CONF, &tmp_ConfigOperating, CH_NONE);
		validate_res = PTCPARSER_ValidateConfigOperating(&tmp_ConfigOperating);																/* Validate Config */
		if(validate_res) {
			printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Validate failed(ERR_%d) \r\n", validate_res);
			return 1;
		}else {
			if(EEPROM_WriteBuf(OPERATING_BASEADDR, &tmp_ConfigOperating, sizeof(STCONFIG_OPERATING))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write Operating_Configuration Error \r\n");
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_ConfigOperating, &tmp_ConfigOperating, sizeof(STCONFIG_OPERATING));								/* Save Configuration into Config_Structure */
				if(src == DEBUG_PORT) {																																						/* If config from debug port, Set flag for update to server */
					flag_isConfOperUpdate = true;
				}
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_BUZZER) {																								/*--- Buzzer Config ---*/
		memcpy(&tmp_ConfigBuzzer, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_BUZZER));												/* Copy to temp config structure */
		vMAIN_PrintConfig(printLevel, BUZZER_CONF, &tmp_ConfigBuzzer, CH_NONE);
		validate_res = PTCPARSER_ValidateConfigBuzzer(&tmp_ConfigBuzzer);																			/* Validate Config */
		if(validate_res) {
			printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Validate failed(ERR_%d) \r\n", validate_res);
			return 1;
		}else {
			if(EEPROM_WriteBuf(BUZZER_BASEADDR, &tmp_ConfigBuzzer, sizeof(STCONFIG_BUZZER))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write Buzzer_Configuration Error \r\n");
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_ConfigBuzzer, &tmp_ConfigBuzzer, sizeof(STCONFIG_BUZZER));													/* Save Configuration into Config_Structure --*/
				if(src == DEBUG_PORT) {
					flag_isConfBuzzUpdate = true;
				}
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_WORKING) {																							/*--- Working Config ---*/
		memcpy(&tmp_ConfigWorking, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_WORKING));											
		vMAIN_PrintConfig(printLevel, WORKING_CONF, &tmp_ConfigWorking, CH_NONE);
		validate_res = PTCPARSER_ValidateConfigWorking(&tmp_ConfigWorking);																		
		if(validate_res) {
			printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Validate failed(ERR_%d) \r\n", validate_res);
			return 1;
		}else {
			if(EEPROM_WriteBuf(WORKING_BASEADDR, &tmp_ConfigWorking, sizeof(STCONFIG_WORKING))) {					
				printDebug(MAJOR_ERR, "[EEPROM]: Write Working_Configuration Error \r\n");
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_ConfigWorking, &tmp_ConfigWorking, sizeof(STCONFIG_WORKING));
				if(src == DEBUG_PORT) {
					flag_isConfWorkUpdate = true;
				}
				_Transmit_Period = 0;				// Reset transmission data time
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_NETWORK) {																							/*--- Network Config ---*/
		memcpy(&tmp_ConfigNetwork, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_NETWORK));
		vMAIN_PrintConfig(printLevel, NETWORK_CONF, &tmp_ConfigNetwork, CH_NONE);
		validate_res = PTCPARSER_ValidateConfigNetwork(&tmp_ConfigNetwork);
		if(validate_res) {
			printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite>: Validate failed(ERR_%d) \r\n", validate_res);
			return 1;
		}else {
			if(EEPROM_WriteBuf(NETWORK_BASEADDR, &tmp_ConfigNetwork, sizeof(STCONFIG_NETWORK))) {
				_LED_ERR_ON = LED_ERR_TIME;
				printDebug(MAJOR_ERR, "[EEPROM]: Write Network_Configuration Error \r\n");
				return 1;
			}else {
				memcpy(&struct_ConfigNetwork, &tmp_ConfigNetwork, sizeof(STCONFIG_NETWORK));
				if(src == DEBUG_PORT) {
					flag_isConfNetwUpdate = true;
				}
			}
		}
	}else if((confSpec[CONF_INDEX_CNFG]&0xF0) == CONF_CNFG_420SENSOR1) {																		/*--- Analog Sensor ---*/
		analogIndex = (confSpec[CONF_INDEX_CNFG]&0x0F); 																											/* Index 4-20mA Sensor Channel id */
		if(analogIndex <= 5) {																																									/*--- 4-20mA Sensor Config CH1-6 (0xA0-0xA5) ---*/	
			memcpy(&tmp_ConfigAnalogSensor, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_ANALOGSENSOR));
			vMAIN_PrintConfig(printLevel, SEN420_CONF, &tmp_ConfigAnalogSensor, analogIndex);
			if(EEPROM_WriteBuf(SEN420CONF_BASEADDR[analogIndex], &tmp_ConfigAnalogSensor, sizeof(STCONFIG_ANALOGSENSOR))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write 4-20mASensor_Configuration CH_%d Error \r\n", analogIndex+1);
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_Config420Sensor[analogIndex], &tmp_ConfigAnalogSensor, sizeof(STCONFIG_ANALOGSENSOR));
				if(src == DEBUG_PORT) {
					flag_isConf420SensUpdate[analogIndex] = true;
				}
			}
		}else if((analogIndex >= 0x06) && (analogIndex <= 0x07)) {																							/*--- ADCSensor Config CH1-2 (0xA6-0xA7) ---*/
			analogIndex -= 0x06;																																									/* Update index */
			memcpy(&tmp_ConfigAnalogSensor, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_ANALOGSENSOR));
			vMAIN_PrintConfig(printLevel, SENADC_CONF, &tmp_ConfigAnalogSensor, analogIndex);
			if(EEPROM_WriteBuf(SENADCCONF_BASEADDR[analogIndex], &tmp_ConfigAnalogSensor, sizeof(STCONFIG_ANALOGSENSOR))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write ADCSensor_Configuration CH_%d Error \r\n", analogIndex+1);
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_ConfigADCSensor[analogIndex], &tmp_ConfigAnalogSensor, sizeof(STCONFIG_ANALOGSENSOR));
				if(src == DEBUG_PORT) {
					flag_isConfADCSensUpdate[analogIndex] = true;
				}
			}
		}else if((analogIndex >= 0x08) && (analogIndex <= 0x0D)) {																							/*--- 4-20mA Sensor Calibration CH1-6 (0xA8-0xAD) ---*/
			analogIndex -= 0x08;																																									/* Update index */
			tmp_Config420Cal.calculation 	= confSpec[CONF_INDEX_SPEC];
			memcpy(&tmp_calValue, &confSpec[CONF_INDEX_SPEC+1], sizeof(float));
			tmp_Config420Cal.cal_val 			= tmp_calValue;
			tmp_Config420Cal.real_val 		= _val420mA_sensor[analogIndex];
			tmp_float											= (((float)_adc420mA_sensor[analogIndex]*102.4)/(4095.0*4.99));
			tmp_Config420Cal.constant 		= tmp_Config420Cal.cal_val - tmp_float;
			vMAIN_PrintConfig(printLevel, SEN420CAL_CONF, &tmp_Config420Cal, analogIndex);
			if(EEPROM_WriteBuf(SEN420CHnCAL_BASEADDR[analogIndex], &tmp_Config420Cal, sizeof(STCONFIG_420CAL))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write 420mASensor_Calibrate CH_%d Error \r\n", analogIndex+1);
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				struct_Config420Cal[analogIndex].calculation 	= tmp_Config420Cal.calculation;
				struct_Config420Cal[analogIndex].cal_val 			= tmp_Config420Cal.cal_val;
				struct_Config420Cal[analogIndex].real_val 		= tmp_Config420Cal.real_val;
				struct_Config420Cal[analogIndex].constant 		= tmp_Config420Cal.constant;
			}
		}else if(analogIndex == 0x0E) {																																					/*--- 4-20mAInput Valve Calibration (0xAE) ---*/
			tmp_Config420Cal.calculation 	= confSpec[CONF_INDEX_SPEC];
			memcpy(&tmp_calValue, &confSpec[CONF_INDEX_SPEC+1], sizeof(float));
			tmp_Config420Cal.cal_val 			= tmp_calValue;
			tmp_Config420Cal.real_val 		= _Valve_mA;
			tmp_float											= (((float)_adc420mA_inputVal*102.4)/(4095.0*4.99));
			tmp_Config420Cal.constant 		= tmp_Config420Cal.cal_val - tmp_float;
			vMAIN_PrintConfig(printLevel, VALVE420INCAL_CONF, &tmp_Config420Cal, CH_NONE);
			if(EEPROM_WriteBuf(VALVE420INCAL_BASEADDR, &tmp_Config420Cal, sizeof(STCONFIG_420CAL))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write In420mAValve_Calibrate Error \r\n");
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				/*-- Save Configuration into Config_Structure --*/
				struct_Config420ValveInCal.calculation 	= tmp_Config420Cal.calculation;
				struct_Config420ValveInCal.cal_val 			= tmp_Config420Cal.cal_val;
				struct_Config420ValveInCal.real_val 		= tmp_Config420Cal.real_val;
				struct_Config420ValveInCal.constant 		= tmp_Config420Cal.constant;
			}
		}else if(analogIndex == 0x0F) {																																				/*--- 4-20mAOutput Valve Calibration (0xAF) ---*/
			tmp_Config420Cal.calculation 	= confSpec[CONF_INDEX_SPEC];
			memcpy(&tmp_calValue, &confSpec[CONF_INDEX_SPEC+1], sizeof(float));
			tmp_Config420Cal.cal_val 			= tmp_calValue;
			tmp_Config420Cal.real_val			= 0.0; // un-use
			tmp_float 										= (TCLICK_SLOPE * tmp_Config420Cal.cal_val);
			tmp_Config420Cal.constant 		= _ADC_TClick - tmp_float;
			vMAIN_PrintConfig(printLevel, VALVE420OUTCAL_CONF, &tmp_Config420Cal, CH_NONE);
			if(EEPROM_WriteBuf(VALVE420OUTCAL_BASEADDR, &tmp_Config420Cal, sizeof(STCONFIG_420CAL))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write Out420mAValve_Calibrate Error \r\n");
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				struct_Config420ValveOutCal.calculation 	= tmp_Config420Cal.calculation;
				struct_Config420ValveOutCal.cal_val 			= tmp_Config420Cal.cal_val;
				struct_Config420ValveOutCal.real_val			= tmp_Config420Cal.real_val;
				struct_Config420ValveOutCal.constant 			= tmp_Config420Cal.constant;
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_MODBUSSENS) {																						/*--- MODBUS FlowSensor Config ---*/
		memcpy(&tmp_ConfigMODBUSSensor, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_MODBUSSENSOR));
		vMAIN_PrintConfig(printLevel, SENMODBUS_CONF, &tmp_ConfigMODBUSSensor, CH_NONE);
		if(EEPROM_WriteBuf(SENsMODBUSCONF_BASEADDR, &tmp_ConfigMODBUSSensor, sizeof(STCONFIG_MODBUSSENSOR))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write MODBUSFlowSensor_Configuration Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigMODBUSSensor, &tmp_ConfigMODBUSSensor, sizeof(STCONFIG_MODBUSSENSOR));
			if(src == DEBUG_PORT) {
					flag_isConfMODBUSSensUpdate = true;
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_PULSESENS) {																						/*--- PULSES FlowSensor Config ---*/
		memcpy(&tmp_ConfigPulseSensor, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_PULSESENSOR));
		vMAIN_PrintConfig(printLevel, SENPULSE_CONF, &tmp_ConfigPulseSensor, CH_NONE);
		if(EEPROM_WriteBuf(SENsPULCONF_BASEADDR, &tmp_ConfigPulseSensor, sizeof(STCONFIG_PULSESENSOR))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write PULSEFlowSensor_Configuration Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			delay_ms(300);
			_Sensor_Data.dataPULSENet = 0.0;
			struct_Status.net_flow 		= 0.0;
			tmp_float 								= 0.0;
			if(EEPROM_WriteBuf(NETFLOW_BASEADDR, &tmp_float, sizeof(float))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write Status NetFlow Error (1 times) \r\n");
				delay_ms(500);
				if(EEPROM_WriteBuf(NETFLOW_BASEADDR, &tmp_float, sizeof(float))) {
					printDebug(MAJOR_ERR, "[EEPROM]: Write Status NetFlow Error (2 times) \r\n");
				}
			}
			memcpy(&struct_ConfigPulseSensor, &tmp_ConfigPulseSensor, sizeof(STCONFIG_PULSESENSOR));
			if(src == DEBUG_PORT) {
				flag_isConfPulsSensUpdate = true;
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_PULSEADJ) {																							/*-- PULSE FlowSensor Value Adjustment --*/
		memcpy(&tmp_ConfigPulseADJ.multiplier_value, &confSpec[CONF_INDEX_SPEC], sizeof(float));
		vMAIN_PrintConfig(printLevel, SENPULSEADJ_CONF, &tmp_ConfigPulseADJ, CH_NONE);
		if(EEPROM_WriteBuf(SENPULSEADJ_BASEADDR, &tmp_ConfigPulseADJ, sizeof(STCONFIG_PULSEADJ))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write PULSEFlowValue_Adjustment Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigPulseADJ.multiplier_value, &tmp_ConfigPulseADJ.multiplier_value, sizeof(float));
			/* Reset data_pulse buffer */
			_index_pulseData		= 0;
			_PulseData_Counter 	= 0;	
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_VALVE) {																								/*--- Valve Config ---*/
		memcpy(&tmp_ConfigValve, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_VALVE));
		vMAIN_PrintConfig(printLevel, VALVE_CONF, &tmp_ConfigValve, CH_NONE);
		if(EEPROM_WriteBuf(VALVECONF_BASEADDR, &tmp_ConfigValve, sizeof(STCONFIG_VALVE))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write Valve_Configuration Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigValve, &tmp_ConfigValve, sizeof(STCONFIG_VALVE));
			if(src == DEBUG_PORT) {
				flag_isConfValveUpdate = true;
			}
		}
	}else if((confSpec[CONF_INDEX_CNFG]&0xF0) == CONF_CNFG_DIN1) {																					/*--- Digital Input CH1-12 ---*/
		dinCh = (confSpec[CONF_INDEX_CNFG]&0x0F);																															/* Index Digital Input Channel id */
		memcpy(&tmp_ConfigDIN, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_DIGITALsIN));
		vMAIN_PrintConfig(printLevel, DIN_CONF, &tmp_ConfigDIN, dinCh);
		if(EEPROM_WriteBuf(DIGItIN_BASEADDR[dinCh], &tmp_ConfigDIN, sizeof(STCONFIG_DIGITALsIN))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write DIN_Configuration CH_%d Error \r\n", dinCh+1);
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigDIN[dinCh], &tmp_ConfigDIN, sizeof(STCONFIG_DIGITALsIN));
			if(src == DEBUG_PORT) {
				flag_isConfDINUpdate[dinCh] = true;
			}
		}
	}else if((confSpec[CONF_INDEX_CNFG]&0xF0) == CONF_CNFG_420SENsAL1) {																		/*--- Analog Sensor Alarm ---*/							
		sensAlarmCh = (confSpec[CONF_INDEX_CNFG]&0x0F);																												/* Arr Index */
		if(sensAlarmCh <= 0x05) {																																								/*--- 4-20mA Sensor Alarm CH1-6 (0xD0-0xD5) ---*/	
			memcpy(&tmp_ConfigSensorAlarm, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_SENSORALARM));
			vMAIN_PrintConfig(printLevel, SEN420ALARM_CONF, &tmp_ConfigSensorAlarm, sensAlarmCh);
			if(EEPROM_WriteBuf(SEN420ALARMn_BASEADDR[sensAlarmCh], &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write 4-20mASensorAlarm_Configuration CH_%d Error \r\n", sensAlarmCh+1);
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_Config420SensorAlarm[sensAlarmCh], &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM));
				if(src == DEBUG_PORT) {
					flag_isConf420AlamUpdate[sensAlarmCh] = true;
				}
			}
		}else if((sensAlarmCh >= 0x06) && (sensAlarmCh <= 0x07)) {																							/*--- ADCSensor Config Alarm CH1 (0xD6) ---*/
			sensAlarmCh -= 0x06;																																									/* Update arr index */
			memcpy(&tmp_ConfigSensorAlarm, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_SENSORALARM));
			vMAIN_PrintConfig(printLevel, SENADCALARM_CONF, &tmp_ConfigSensorAlarm, sensAlarmCh);
			if(EEPROM_WriteBuf(SENADCALARMn_BASEADDR[sensAlarmCh], &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM))) {
				printDebug(MAJOR_ERR, "[EEPROM]: Write ADCSensorAlarm_Configuration CH_%d Error \r\n", sensAlarmCh+1);
				_LED_ERR_ON = LED_ERR_TIME;
				return 1;
			}else {
				memcpy(&struct_ConfigADCSensorAlarm[sensAlarmCh], &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM));
				if(src == DEBUG_PORT) {
					flag_isConfADCAlamUpdate[sensAlarmCh] = true;
				}
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_MODBUSSENsAL) { 																				/*--- MODBUS FlowSensor Alarm ---*/
		memcpy(&tmp_ConfigSensorAlarm, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_SENSORALARM));
		vMAIN_PrintConfig(printLevel, SENMODBUSALARM_CONF, &tmp_ConfigSensorAlarm, CH_NONE);
		if(EEPROM_WriteBuf(SENsMODBUSALARM_BASEADDR, &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write MODBUSFlowSensorAlarm_Configuration Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigMODBUSSensorAlarm, &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM));
			if(src == DEBUG_PORT) {
				flag_isConfMODBUSAlamUpdate = true;
			}
		}
	}else if(confSpec[CONF_INDEX_CNFG] == CONF_CNFG_PULSENsAL) {																						/*--- Pulse Sensor Alarm ---*/
		memcpy(&tmp_ConfigSensorAlarm, &confSpec[CONF_INDEX_SPEC], sizeof(STCONFIG_SENSORALARM));
		vMAIN_PrintConfig(printLevel, SENPULSEALARM_CONF, &tmp_ConfigSensorAlarm, CH_NONE);
		if(EEPROM_WriteBuf(SENsPULALARM_BASEADDR, &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM))) {
			printDebug(MAJOR_ERR, "[EEPROM]: Write FlowFlowSensorAlarm_Configuration Error \r\n");
			_LED_ERR_ON = LED_ERR_TIME;
			return 1;
		}else {
			memcpy(&struct_ConfigPulseSensorAlarm, &tmp_ConfigSensorAlarm, sizeof(STCONFIG_SENSORALARM));
			if(src == DEBUG_PORT) {
				flag_isConfPulsAlamUpdate = true;
			}
		}
	}else {
		printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_ConfigWrite> CNFG not define yet. \r\n");
		return 2;
	}
	
