nexts-corp/int-sma/PWA_SL/Project/FreeRTOS/SmartLogger_v4/INTELENICS_Library/src/INT_STM32F4_ProtocolHandle.c
	return 0;
}
/*==========================================================================================*/
/**
  * @brief  This function handle TimeSync packet.
  * @param  
  * @retval Error code.
  */
uint8_t ucPTCHANDLE_RemoteCtrl(uint8_t cid, uint8_t *value) {
	
	uint8_t 				doutCH 				= 0;   		// Index Digital Output
	uint32_t				valve_value 	= 0;			// Butterfly Valve %Open
	uint8_t 				i;
	ST_UPDATE_STAT	up_stat;
	
//	printDebug_Semphr(INFO, "<PTCHANDLE_RemoteCtrl> CID: %02X   VAL: %d \r\n", cid, value[3]);
	
	if((cid&0xF0) == 0x20) {
		doutCH = (cid & 0x0F) - 1;
		/* Validate CID */
		if((cid != 0x2F) && (doutCH >= MAX_DOUT)) {
			return 1;
		}
		/* Validate Value */
		if((value[0] == 1) || (value[0] == 0)) {
			if(cid == 0x2F) {
				for(i = 0; i < MAX_DOUT; i++) {
					GPIO_WriteBit((GPIO_TypeDef*)DOUTn_PORT[i], DOUTn_PIN[i], value[0]);
					if(EEPROM_WriteBuf(DOUTn_BASEADDR[i], &value[0], sizeof(uint8_t))) {
						_LED_ERR_ON = LED_ERR_TIME;
						printDebug(MINOR_ERR, "<PTCHANDLE_RemoteCtrl>: EEPROM_Write DOUT_%d Status Error \r\n", i+1);
					}
				}
			}else {
				GPIO_WriteBit((GPIO_TypeDef*)DOUTn_PORT[doutCH], DOUTn_PIN[doutCH], value[0]);
				if(EEPROM_WriteBuf(DOUTn_BASEADDR[doutCH], &value[0], sizeof(uint8_t))) {
					_LED_ERR_ON = LED_ERR_TIME;
					printDebug(MINOR_ERR, "<PTCHANDLE_RemoteCtrl>: EEPROM_Write DOUT_%d Status Error \r\n", doutCH+1);
				}
			}
		}else {
			return 2;
		}
	}else if(cid == CID_DRVVALVE) {
		memcpy(&valve_value, value, sizeof(uint32_t));
		/* Validate Value */
		if(valve_value <= 100) {
			if(!xQueueSend(Queue_CtrlValve, &valve_value, 0)) {
				printDebug_Semphr(MINOR_ERR, "<PTCHANDLE_RemoteCtrl>: Send Queue_CtrlValve failed. \r\n");
			}else {
				if(EEPROM_WriteBuf(VALVE_BASEADDR, &valve_value, sizeof(uint8_t))) {
					_LED_ERR_ON = LED_ERR_TIME;
					printDebug(MINOR_ERR, "<PTCHANDLE_RemoteCtrl>: EEPROM_Write Valve Status Error \r\n");
				}
			}
		}else {
			return 3;
		}
	}else {
		return 4;
	}
	
	return 0;
}
/*==========================================================================================*/
/**
  * @brief  This function handle TimeSync packet.
  * @param  
  * @retval None
  */
uint8_t vPTCHANDLE_TimeSync(uint8_t *buf) {
	
	int32_t timesync = 0;
	uint32_t currentTime = 0;
//	uint8_t i;
	
	/* internal RTC */
	currentTime = uiRTC_GetEpochTime();
	
	memcpy(&timesync, buf, sizeof(uint32_t));
	
	if(timesync <= 0) {
		return 1;
	}
	
	if(abs(timesync-currentTime) > 120) {  						// if difference more than 2 min.
		if(ucRTC_SetDateTimeFromEpoch(timesync)) {
			/* ucRTC_SetDateTimeFromEpoch Failed */
			return 2;
		}else {
			_Transmit_Period = 0;				// Reset transmission data time
			printDebug_Semphr(INFO, "<PTCHANDLE_TimeSync> Setting Date & Time (%d) \r\n", timesync);
		}
		
	}
	return 0;
}
/*==========================================================================================*/

